---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.GetBlue
source: html/3f299d95-fd17-23ea-0916-8b3e1b4009f4.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.GetBlue Method

get blue

## Syntax (C#)
```csharp
public uint GetBlue()
```

## Returns
blue